{
    "v0": {
        "19": [
            {
                "patch": 0,
                "entries": [
                    {
                        "page": "Anwesenheiten",
                        "changes": [
                            "Bearbeitungsmodus zur Übersicht hinzugefügt"
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes": [
                            "Mobile Anzeige verbessert, Nutzbarkeit optimiert"
                        ]
                    }
                ]
            }
        ],
        "18": [
            {
                "patch": 1,
                "entries": [
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Logo-URL angepasst"
                        ]
                    },
                    {
                        "page": "Startseite",
                        "changes": [
                            "Fehler behoben, wodurch falsche Geburststage angezeigt wurden"
                        ]
                    }
                ]
            },
            {
                "patch": 0,
                "entries": [
                    {
                        "page": "Anwesenheiten",
                        "changes":[
                            "Einschätzung für Termine ist verschieden für Auftritte und Übungsstunden",
                            "Positive Rückmeldungen werden in der Übersicht mit einem Hinweis versehen, wenn der Nutzer trotz positiver Rückmeldung nicht anwesend war",
                            "Möglichkeit hinzugefügt, auch verspätete Teilnahmen zu erfassen"
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes":[
                            "Menü im unteren Bereich hinzugefügt, um schneller zwischen den Seiten zu wechseln",
                            "Kleinere Designanpassungen",
                            "Daten-Caching verbessert, um aktuelle Daten anzuzeigen und gleichzeitig die Ladezeiten zu reduzieren",
                            "Adventsüberraschung hinzugefügt (Warten auf den Dezember...)",
                            "Halloween-Theme hinzugefügt (nur um Halloween herum sichtbar)"
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes":[
                            "Termine können jetzt auch ein Enddatum haben",
                            "Für Termine wird die Event_ID angezeigt"
                        ]
                    },
                    {
                        "page": "Benachrichtigungen",
                        "changes":[
                            "Das Aktivieren der Push-Benachrichtigungen aktualisiert das Glocken-Symbol nun automatisch",
                            "Falls die Anmeldung für Push-Benachrichtigungen scheitert, wird ein entsprechender Hinweis angezeigt"
                        ]
                    },
                    {
                        "page": "Hilfe/Datenschutz",
                        "changes":[
                            "Die Hilfe wurde überarbeitet und um einen Datenschutz-Hinweis erweitert"
                        ]
                    }
                ]
            }
        ],
        "17": [
            {
                "patch": 4,
                "entries":[
                    {
                        "page": "Termine",
                        "changes":[
                            "Fehler erneut behoben, wodurch abgelehnte Termine weiterhin angezeigt wurden. Termine wurden in der mobile Ansicht nicht korrekt angezeigt."
                        ]
                    }
                ]
            },
            {
                "patch": 3,
                "entries":[
                    {
                        "page": "Termine",
                        "changes":[
                            "Fehler behoben, wodurch abgelehnte Termine weiterhin angezeigt wurden, da veraltete Daten aus dem Cache geladen wurden"                            
                        ]
                    }
                ]
            },
            {
                "patch": 2,
                "entries": [
                    {
                        "page": "Startseite",
                        "changes": [
                            "Anfragen werden auf der Startseite als solche markiert"
                        ]
                    }
                ]
            },
            {
                "patch": 1,
                "entries": [
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Anzeige für Konfetti repariert"
                        ]
                    }
                ]
            },
            {
                "patch": 0,
                "entries": [
                    {
                        "page": "Anwesenheiten",
                        "changes": [
                            "Eingabe der Anwesenheit an die Startseite angepasst, um die Bedienung zu erleichtern",
                            "Die Übersicht der Instrumente ist jetzt variabel und lässt mehr Bezeichnungen zu. Auch die vermutete Anwesenheit wird jetzt angezeigt.",
                            "Übersicht für bessere Lesbarkeit überarbeitet, Ladezeiten optimiert"
                        ]
                    },
                    {
                        "page": "Login",
                        "changes": [
                            "Button hinzugefügt, mit dem ein neues Passwort angefordert werden kann"
                        ]
                    },
                    {
                        "page": "Startseite",
                        "changes": [
                            "Das Wetter wird für Termine in den nächsten 48 Stunden auf 15 Minuten genau angezeigt"
                        ]
                    },
                    {
                        "page": "Auswertung",
                        "changes": [
                            "Eingabe der tatsächlichen Anwesenheit vereinfacht",
                            "Standartmäßig wird die Wertung des aktuellen Jahres angezeigt"
                        ]
                    },
                    {
                        "page": "Verwaltung",
                        "changes": [
                            "Zuordnung zu Vereinen überarbeitet. Zuordnung von Instrumenten ist jetzt pro Verein möglich, nicht mehr global."
                        ]
                    },
                    {
                        "page": "Hilfe/Datenschutz",
                        "changes": [
                            "Datenschutzhinweis aktualisiert"
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes": [
                            "Die persönlichen Termine können jetzt auch als Kalender abonniert werden. Abgesagte Termine werden nicht angezeigt."
                        ]
                    }
                ]
            }
        ],
        "16": [
            {
                "patch": 2,
                "entries":[
                    {
                        "page": "Anwesenheiten",
                        "changes": [
                            "Die Liste zeigt wieder standartmäßig alle Termine an. Die Auswahl für ausstehende Rückmeldungen ist weiterhin auswählbar."
                        ]
                    }
                ]
            },
            {
                "patch": 1,
                "entries":[
                    {
                        "page": "Startseite, Anwesenheiten",
                        "changes": [
                            "Abmeldungen sind nur bis zu einer bestimmten Zeit vor jedem Termin möglich. Anmeldungen sind bis zum Beginn des Termins möglich."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Animation für aktuelles Wetter sowie Konfetti in der Karnevalssession hinzugefügt"
                        ]
                    }
                ]
            },
            {
                "patch": 0,
                "entries":[
                    {
                        "page": "Anwesenheiten",
                        "changes": [
                            "In der Anwesenheitsübersicht wird die Prognose pro Person angezeigt, um auch die Stimmen besser einschätzen zu können",
                            "Die erste Nutzergruppe in der Übersicht wird automatisch ausgewählt",
                            "Bei der Eingabe der Anwesenheit werden abgesagte Termine nicht mehr angezeigt",
                            "Anfragen werden gelb angezeigt, um sie besser von angenommenen Terminen unterscheiden zu können",
                            "Striche zwischen den Terminen zeigen an, ob die Termine am selben Tag oder in der selben Woche stattfinden"
                        ]
                    },
                    {
                        "page": "Startseite",
                        "changes": [
                            "Für Proben wird eine Linie bei 13 Personen gezogen, um auf einen Blick zu sehen, ob die Probe stattfinden kann.",
                            "Die Eingabe der Anwesenheit wurde angepasst, um die Bedienung zu erleichtern.",
                            "Abgesagte Termine werden auf der Startseite rot markiert."
                        ]
                    },
                    {
                        "page": "Einstellungen",
                        "changes": [
                            "Infotext hinzugefügt, um zu erklären, warum ein Passwort notwendig ist und nicht direkt die Startseite angezeigt wird."
                        ]
                    },
                    {
                        "page": "Login",
                        "changes": [
                            "Die Anzeige, dass kein Passwort gesetzt ist, wurde entfernt, da direkt zu den Einstellungen weitergeleitet wird.",
                            "Der Anzeigemodus (Dark/Light/forced) für das Gerät wird gespeichert, um die Anzeige zu optimieren."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "API Endpunkte vereinheitlicht. Ermöglicht eine bessere Wartung sowie verbesserte Offline-Fähigkeit."
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes": [
                            "Status hinzugefügt, um anzuzeigen, ob ein Termin eine Anfrage ist, angenommen, abgelehnt oder abgesagt wurde."
                        ]
                    }
                ]
            }
        ],
        "15": [
            {
                "patch": 1,
                "entries":[
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Fehler behoben, wodurch die App auf manchen Geräten automatisch übersetzt wurde"
                        ]
                    }
                ]
            },
            {
                "patch": 0,
                "entries":[
                    {
                        "page": "Startseite",
                        "changes": [
                            "Für Open-Air-Proben wird jetzt auch das Wetter angezeigt.",
                            "Die Vorraussage für die Anzahl der Teilnehmer wurde verbessert."
                        ]
                    },
                    {
                        "page": "Anwesenheiten",
                        "changes": [
                            "Unter der Übersichtstabelle werden jetzt auch die vermuteten Teilnehmer angezeigt, analog zur Startseite.",
                            "Die erste Zeile in der Übersichtstabelle ist jetzt fixiert, damit die Namen bzw. Kürzel immer sichtbar sind.",
                            "Die Vorraussage für die Anzahl der Teilnehmer wurde verbessert."
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes": [
                            "Termine, die nicht angenommen wurden, werden jetzt in der Detailansicht rot markiert."
                        ]
                    },
                    {
                        "page": "Auswertung",
                        "changes": [
                            "Unter dem Reiter \"Auswertung\" wird eine persönliche Auswertung angezeigt. Die Bewertungsmethode ist noch nicht final, grundsätzlich wird Anwesenheit positiv bewertet, unentschuldigtes Fehlen negativ."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Rechtesystem umgesetzt bei Anwesenheiten, Auswertung, Mitglieder und Rollenverwaltung",
                            "Wenn der Nutzer kein Passwort gesetzt hat, wird er sofort zu den Einstellungen weitergeleitet",
                            "Auf dem Server wird eine eindeutige ID für das Gerät gespeichert, um auf Dauer mehrfache Anmeldungen zu verhindern."
                        ]
                    },
                    {
                        "page": "Urlaub/Abmeldung",
                        "changes": [
                            "Abmeldungen können für einzelne Wochentage sowie z.B. nur in geraden/ungeraden Wochen vorgenommen werden. Praktisch für beispielsweise Wechselschicht oder Gardetraining, ohne sich gleichzeitig von den Auftritten abzumelden."
                        ]
                    },
                    {
                        "page": "Hilfe/Datenschutz",
                        "changes": [
                            "Zusätzlich zur Hilfe wird angegeben, welche Daten gespeichert werden und wie sie genutzt werden."
                        ]
                    }
                ]
            }
        ],
        "14": [
            {
                "patch": 1,
                "entries":[
                    {
                        "page": "Verwaltung",
                        "changes": [
                            "Fehler behoben, wodurch die Verwaltung nicht mehr erreichbar war"
                        ]
                    },
                    {
                        "page": "Startseite",
                        "changes": [
                            "Fehler behoben, wodurch die Wetteranzeige nicht mehr korrekt funktionierte, wenn kein Ort hinterlegt war"
                        ]
                    },
                    {
                        "page": "Urlaub",
                        "changes": [
                            "Fehler behoben, wodurch der Beginn eines Urlaubs hinter dem Ende liegen konnte"
                        ]
                    },
                    {
                        "page": "Login",
                        "changes": [
                            "Anzeigefehler unter Mozilla Firefox behoben"
                        ]
                    }
                ]                            
            },
            {
                "patch": 0,
                "entries":[
                    {
                        "page": "Noten",
                        "changes": [
                            "Die Noten können nur noch eingesehen werden, wenn der Nutzer ein Passwort gesetzt hat. Das Passwort kann in den Einstellungen gesetzt werden."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Die App wurde für bessere Offline-Nutzbarkeit optimiert. Es wird weiterhin eine Internetverbindung benötigt, die Verwendung ist aber bei schlechter Verbindung robuster geworden.",
                            "Neues Rechtesystem eingeführt. Über Rollen kann jetzt festgelegt werden, welche Berechtigungen ein Nutzer hat. Die Rollen können von Admins vergeben werden.",
                            "Der Übergang vom alten zum neuen System ist fließend und wird nicht direkt sichtbar sein. Zuvor wurde ein Zugriffslevel pro Benutzer festgelegt, mit dem neuen System ist es möglich, einzelne Funktionen pro Verein freizugeben."
                        ]
                    },
                    {
                        "page": "Startseite",
                        "changes": [
                            "Weitere Ladeanimation hinzugefügt, damit der Nutzer weiß, dass die App noch arbeitet.",
                            "Das Wetter wird jetzt laufend aktualisiert, auch wenn die App eine Weile geöffnet war",
                            "Termine können jetzt auf der Startseite fixiert werden. Dadurch werden schneller Rückmeldungen für beispielsweise Anfragen ermöglicht.",
                            "Die Wetteranzeige wurde überarbeitet und ist jetzt leichter verständlich.",
                            "Neue optionale Ladeanimation hinzugefügt"
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes": [
                            "Für jeden Termin kann jetzt angegeben werden, ob eine Push-Benachrichtigung gesendet werden soll."
                        ]
                    }
                ]
            }
        ],
        "13": [
            {
                "patch": 5,
                "entries":[
                    {
                        "page": "Anwesenheiten",
                        "changes": [
                            "Fehler behoben, wodurch die Anwesenheiten bei installierten Apps unter Safari nicht korrekt angezeigt wurden"
                        ]
                    }
                ]
            },
            {
                "patch": 4,
                "entries":[
                    {
                        "page": "Urlaub",
                        "changes": [
                            "Fehler behoben, wodurch Abwesenheiten von 00.00.0000 eingegeben werden konnten"
                        ]
                    }
                ]
            },
            {
                "patch": 3,
                "entries": [
                    {
                        "page": "Termine",
                        "changes": [
                            "Fehler behoben, wodurch abgelehnte Termine weiterhin angezeigt wurden"
                        ]
                    }
                ]
            },
            {
                "patch": 2,
                "entries":[
                    {
                        "page": "Startseite",
                        "changes": [
                            "Die Anzeige der Zusagen im Diagramm wurde gefixt. Zusagen mit Partnern wurden nicht als Zusage angezeigt"
                        ]
                    }
                ]
            },
            {
                "patch": 1,
                "entries":[
                    {
                        "page": "Login",
                        "changes": [
                            "Wenn Rechte verändert werden, ändert sich Access-Token. Ungültige \"alte\" Access-Token werden abgefangen und der Nutzer wird aufgefordert, sich neu einzuloggen."
                        ]
                    }
                ]
            },
            {
                "patch": 0,
                "entries":[
                    {
                        "page": "Startseite",
                        "changes": [
                            "Ladeanimation bei Terminen hinzugefügt",
                            "Die Zusage ist jetzt nur noch für anstehende Termine möglich. Sobald der Termin begonnen hat, ist das Feld deaktiviert.",
                            "Der Balken unter den Terminen zeigt in hellen Farbtönen die erwarteten Rückmeldungen an. Das System wird noch getestet, die Vorhersage liegt aber recht nah am tatsächlichen Ergebnis."
                        ]
                    },
                    {
                        "page": "Login",
                        "changes": [
                            "Der Nutzer wird jetzt informiert, wenn er noch kein Passwort gesetzt hat."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Die App wurde für bessere Offline-Nutzbarkeit optimiert. Es wird weiterhin eine Internetverbindung benötigt, die Verwendung ist aber bei schlechter Verbindung robuster geworden."
                        ]
                    },
                    {
                        "page": "Startseite/Termine",
                        "changes": [
                            "Neues Icon für die Bekleidung hinzugefügt"
                        ]
                    }
                ]
            }
        ],
        "12": [
            {
                "patch": 5,
                "entries": [
                    {
                        "page": "Startseite",
                        "changes": [
                            "Die Änderungen werden jetzt am Ende der Startseite angezeigt"
                        ]
                    }
                ]
            },
            {
                "patch": 4,
                "entries": [
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Die Fehlermeldungen sammeln mehr Informationen, um Fehler besser nachvollziehen zu können."
                        ]
                    }
                ]
            },
            {
                "patch": 3,
                "entries": [
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Um eine bessere Nutzbarkeit zu garantieren, aktualisiert sich die App jetzt automatisch, wenn eine neue Version verfügbar ist.",
                            "Zudem werden Fehlermeldungen jetzt abgefangen, damit sich die App nicht mehr im Login aufhängt."
                        ]
                    }
                ]
            },
            {
                "patch": 2,
                "entries": [
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Fehler in der Farbanzeige bei Firefox behoben."
                        ]
                    }
                ]
            },
            {
                "patch": 1,
                "entries": [
                    {
                        "page": "Abwesenheiten",
                        "changes": [
                            "Für das bessere Verständnis wurde die Bezeichnung \"Abwesenheiten\" in \"Urlaub\" geändert. Die Funktionalität bleibt gleich."
                        ]
                    },
                    {
                        "page": "Startseite, Anwesenheiten",
                        "changes": [
                            "Die App wartet auf die Rückmeldung vom Server, ob eine Zusage/Absage gespeichert wurde. Um dies zu verdeutlichen, wird während der Wartezeit ein Ladebalken angezeigt."
                        ]
                    }
                ]
            },
            {
                "patch": 0,
                "entries": [
                    {
                        "page": "Startseite/Anwesenheiten",
                        "changes": [
                            "Auf der Startseite und unter Anwesenheiten können jetzt für freigeschaltete Termine Partner mit angegeben werden. Das soll die Planung für Busse etc. erleichtern."
                        ]
                    },
                    {
                        "page": "Startseite",
                        "changes": [
                            "Am Ende der Startseite wird eine kleine Nutzungsstatistik angezeigt."
                        ]
                    },
                    {
                        "page": "Benachrichtigungen",
                        "changes": [
                            "Benachrichtigungen können jetzt auch für die neue Terminkategorie \"Sonstige Termine\" aktiviert/deaktiviert werden. Siehe Einstellungen."
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes": [
                            "Die Termine können jetzt auch nach Kategorien gefiltert werden. Vorher passierte dies nur über den Titel Üben/Probe."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Darüber hinaus wurden einge Dinge im Hintergrund angepasst, damit die App in Zukunft noch besser funktioniert.",
                            "Kleine Aussicht für die Zukunft: Passwörter werden demnächst notwendig, damit z.B. Bildergalerien nur für Mitglieder sichtbar sind. Wer die App bereits installiert hat, wird davon wenig mitbekommen, da ein Login nicht jedes Mal notwendig ist.",
                            "Einige neue Funktionen werden daher auch nur für installierte Apps verfügbar sein."
                        ]
                    }
                ]
            }
        ],
        "11": [
            {
                "patch": 0,
                "entries": [
                    {
                        "page": "Startseite",
                        "changes": [
                            "Für die Termine auf der Startseite können weitere Informationen hinterlegt werden. Einfach auf den Termin tippen, um das Fenster zu öffnen.",
                            "Außerdem werden die Termine jetzt in drei Kategorien eingeteilt und angezeigt: Proben, Auftritte und sonstige Termine."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Benachrichtigungen können an- & abgeschaltet werden, entweder über die Glocke, oder über die Einstellungen. Dort ist auch die Unterscheidung zwischen Üben und Auftritt möglich."
                        ]
                    }
                ]
            }
        ]
    }
}