{
    "v0": {
        "15": [
            {
                "patch": 0,
                "entries":[
                    {
                        "page": "Startseite",
                        "changes": [
                            "Für Open-Air-Proben wird jetzt auch das Wetter angezeigt."
                        ]
                    }
                ]
            }
        ],
        "14": [
            {
                "patch": 1,
                "entries":[
                    {
                        "page": "Verwaltung",
                        "changes": [
                            "Fehler behoben, wodurch die Verwaltung nicht mehr erreichbar war"
                        ]
                    },
                    {
                        "page": "Startseite",
                        "changes": [
                            "Fehler behoben, wodurch die Wetteranzeige nicht mehr korrekt funktionierte, wenn kein Ort hinterlegt war"
                        ]
                    },
                    {
                        "page": "Urlaub",
                        "changes": [
                            "Fehler behoben, wodurch der Beginn eines Urlaubs hinter dem Ende liegen konnte"
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes": [
                            "Fehler behoben, wodurch keine Abfahrtszeiten mehr angegeben werden konnten"
                        ]
                    }
                ]                            
            },
            {
                "patch": 0,
                "entries":[
                    {
                        "page": "Noten",
                        "changes": [
                            "Die Noten können nur noch eingesehen werden, wenn der Nutzer ein Passwort gesetzt hat. Das Passwort kann in den Einstellungen gesetzt werden."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Die App wurde für bessere Offline-Nutzbarkeit optimiert. Es wird weiterhin eine Internetverbindung benötigt, die Verwendung ist aber bei schlechter Verbindung robuster geworden.",
                            "Neues Rechtesystem eingeführt. Über Rollen kann jetzt festgelegt werden, welche Berechtigungen ein Nutzer hat. Die Rollen können von Admins vergeben werden.",
                            "Der Übergang vom alten zum neuen System ist fließend und wird nicht direkt sichtbar sein. Zuvor wurde ein Zugriffslevel pro Benutzer festgelegt, mit dem neuen System ist es möglich, einzelne Funktionen pro Verein freizugeben."
                        ]
                    },
                    {
                        "page": "Startseite",
                        "changes": [
                            "Weitere Ladeanimation hinzugefügt, damit der Nutzer weiß, dass die App noch arbeitet.",
                            "Das Wetter wird jetzt laufend aktualisiert, auch wenn die App eine Weile geöffnet war",
                            "Termine können jetzt auf der Startseite fixiert werden. Dadurch werden schneller Rückmeldungen für beispielsweise Anfragen ermöglicht.",
                            "Die Wetteranzeige wurde überarbeitet und ist jetzt leichter verständlich.",
                            "Neue optionale Ladeanimation hinzugefügt"
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes": [
                            "Für jeden Termin kann jetzt angegeben werden, ob eine Push-Benachrichtigung gesendet werden soll."
                        ]
                    }
                ]
            }
        ],
        "13": [
            {
                "patch": 5,
                "entries":[
                    {
                        "page": "Anwesenheiten",
                        "changes": [
                            "Fehler behoben, wodurch die Anwesenheiten bei installierten Apps unter Safari nicht korrekt angezeigt wurden"
                        ]
                    }
                ]
            },
            {
                "patch": 4,
                "entries":[
                    {
                        "page": "Urlaub",
                        "changes": [
                            "Fehler behoben, wodurch Abwesenheiten von 00.00.0000 eingegeben werden konnten"
                        ]
                    }
                ]
            },
            {
                "patch": 3,
                "entries": [
                    {
                        "page": "Termine",
                        "changes": [
                            "Fehler behoben, wodurch abgelehnte Termine weiterhin angezeigt wurden"
                        ]
                    }
                ]
            },
            {
                "patch": 2,
                "entries":[
                    {
                        "page": "Startseite",
                        "changes": [
                            "Die Anzeige der Zusagen im Diagramm wurde gefixt. Zusagen mit Partnern wurden nicht als Zusage angezeigt"
                        ]
                    }
                ]
            },
            {
                "patch": 1,
                "entries":[
                    {
                        "page": "Login",
                        "changes": [
                            "Wenn Rechte verändert werden, ändert sich Access-Token. Ungültige \"alte\" Access-Token werden abgefangen und der Nutzer wird aufgefordert, sich neu einzuloggen."
                        ]
                    }
                ]
            },
            {
                "patch": 0,
                "entries":[
                    {
                        "page": "Startseite",
                        "changes": [
                            "Ladeanimation bei Terminen hinzugefügt",
                            "Die Zusage ist jetzt nur noch für anstehende Termine möglich. Sobald der Termin begonnen hat, ist das Feld deaktiviert.",
                            "Der Balken unter den Terminen zeigt in hellen Farbtönen die erwarteten Rückmeldungen an. Das System wird noch getestet, die Vorhersage liegt aber recht nah am tatsächlichen Ergebnis."
                        ]
                    },
                    {
                        "page": "Login",
                        "changes": [
                            "Der Nutzer wird jetzt informiert, wenn er noch kein Passwort gesetzt hat."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Die App wurde für bessere Offline-Nutzbarkeit optimiert. Es wird weiterhin eine Internetverbindung benötigt, die Verwendung ist aber bei schlechter Verbindung robuster geworden."
                        ]
                    },
                    {
                        "page": "Startseite/Termine",
                        "changes": [
                            "Neues Icon für die Bekleidung hinzugefügt"
                        ]
                    }
                ]
            }
        ],
        "12": [
            {
                "patch": 5,
                "entries": [
                    {
                        "page": "Startseite",
                        "changes": [
                            "Die Änderungen werden jetzt am Ende der Startseite angezeigt"
                        ]
                    }
                ]
            },
            {
                "patch": 4,
                "entries": [
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Die Fehlermeldungen sammeln mehr Informationen, um Fehler besser nachvollziehen zu können."
                        ]
                    }
                ]
            },
            {
                "patch": 3,
                "entries": [
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Um eine bessere Nutzbarkeit zu garantieren, aktualisiert sich die App jetzt automatisch, wenn eine neue Version verfügbar ist.",
                            "Zudem werden Fehlermeldungen jetzt abgefangen, damit sich die App nicht mehr im Login aufhängt."
                        ]
                    }
                ]
            },
            {
                "patch": 2,
                "entries": [
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Fehler in der Farbanzeige bei Firefox behoben."
                        ]
                    }
                ]
            },
            {
                "patch": 1,
                "entries": [
                    {
                        "page": "Abwesenheiten",
                        "changes": [
                            "Für das bessere Verständnis wurde die Bezeichnung \"Abwesenheiten\" in \"Urlaub\" geändert. Die Funktionalität bleibt gleich."
                        ]
                    },
                    {
                        "page": "Startseite, Anwesenheiten",
                        "changes": [
                            "Die App wartet auf die Rückmeldung vom Server, ob eine Zusage/Absage gespeichert wurde. Um dies zu verdeutlichen, wird während der Wartezeit ein Ladebalken angezeigt."
                        ]
                    }
                ]
            },
            {
                "patch": 0,
                "entries": [
                    {
                        "page": "Startseite/Anwesenheiten",
                        "changes": [
                            "Auf der Startseite und unter Anwesenheiten können jetzt für freigeschaltete Termine Partner mit angegeben werden. Das soll die Planung für Busse etc. erleichtern."
                        ]
                    },
                    {
                        "page": "Startseite",
                        "changes": [
                            "Am Ende der Startseite wird eine kleine Nutzungsstatistik angezeigt."
                        ]
                    },
                    {
                        "page": "Benachrichtigungen",
                        "changes": [
                            "Benachrichtigungen können jetzt auch für die neue Terminkategorie \"Sonstige Termine\" aktiviert/deaktiviert werden. Siehe Einstellungen."
                        ]
                    },
                    {
                        "page": "Termine",
                        "changes": [
                            "Die Termine können jetzt auch nach Kategorien gefiltert werden. Vorher passierte dies nur über den Titel Üben/Probe."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Darüber hinaus wurden einge Dinge im Hintergrund angepasst, damit die App in Zukunft noch besser funktioniert.",
                            "Kleine Aussicht für die Zukunft: Passwörter werden demnächst notwendig, damit z.B. Bildergalerien nur für Mitglieder sichtbar sind. Wer die App bereits installiert hat, wird davon wenig mitbekommen, da ein Login nicht jedes Mal notwendig ist.",
                            "Einige neue Funktionen werden daher auch nur für installierte Apps verfügbar sein."
                        ]
                    }
                ]
            }
        ],
        "11": [
            {
                "patch": 0,
                "entries": [
                    {
                        "page": "Startseite",
                        "changes": [
                            "Für die Termine auf der Startseite können weitere Informationen hinterlegt werden. Einfach auf den Termin tippen, um das Fenster zu öffnen.",
                            "Außerdem werden die Termine jetzt in drei Kategorien eingeteilt und angezeigt: Proben, Auftritte und sonstige Termine."
                        ]
                    },
                    {
                        "page": "Allgemein",
                        "changes": [
                            "Benachrichtigungen können an- & abgeschaltet werden, entweder über die Glocke, oder über die Einstellungen. Dort ist auch die Unterscheidung zwischen Üben und Auftritt möglich."
                        ]
                    }
                ]
            }
        ]
    }
}